[Killed] BlockStatement
main/pages/EnrollmentHistory/EnrollmentHistoryPage.jsx:3:49
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function EnrollmentHistoryPage() {
-  return (
-    <BasicLayout>
-      <h1>Enrollment History</h1>
-      <p>Enrollment history graph coming soon.</p>
-    </BasicLayout>
-  );
-}
+export default function EnrollmentHistoryPage() {}
 
killedBy: App routing tests routes /enrollmenthistory/search to EnrollmentHistoryPage
statusReason: Unable to find role="heading" and name "Enrollment History"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
