[Killed] StringLiteral
main/components/GEAreas/GEAreaSearchForm.jsx:24:22
 
   const quarters = quarterRange(startQtr, endQtr);
 
-  const quarterKey = "GEAreaSearch.Quarter";
+  const quarterKey = "";
   const areaKey = "GEAreaSearch.Area";
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Found a label with the text of: Quarter, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/GEAreas/GEAreaSearchForm.jsx:36:27
     _status,
   } = useBackend(
     ["/api/public/generalEducationInfo"],
-    { method: "GET", url: "/api/public/generalEducationInfo" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expected '' to be 'A1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/GEAreas/GEAreaSearchForm.jsx:36:15
     _status,
   } = useBackend(
     ["/api/public/generalEducationInfo"],
-    { method: "GET", url: "/api/public/generalEducationInfo" },
+    { method: "", url: "/api/public/generalEducationInfo" },
     [],
   );
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

  [
    [

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:42:5
 
   const areaCodes = deduplicateAreaCodes(areas);
   const [quarter, setQuarter] = useState(
-    localQuarter || quarters[0]?.yyyyq || startQtr,
+    false,
   );
   const [area, setArea] = useState(localArea || "");
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: yyyyq.charAt is not a function

[Killed] BlockStatement
main/components/GEAreas/GEAreaSearchForm.jsx:46:19
   );
   const [area, setArea] = useState(localArea || "");
 
-  useEffect(() => {
-    const resolvedArea = getResolvedArea(area, areaCodes);
-    if (resolvedArea !== area) {
-      setArea(resolvedArea);
-    }
-  }, [area, areaCodes]);
+  useEffect(() => {}, [area, areaCodes]);
 
   const handleSubmit = (event) => {
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Searching for A1 in S21
Received:
  Searching for in S21

[Killed] BlockStatement
main/components/GEAreas/GEAreaSearchForm.jsx:48:32
 
   useEffect(() => {
     const resolvedArea = getResolvedArea(area, areaCodes);
-    if (resolvedArea !== area) {
-      setArea(resolvedArea);
-    }
+    if (resolvedArea !== area) {}
   }, [area, areaCodes]);
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Searching for A1 in S21
Received:
  Searching for in S21

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:48:9
 
   useEffect(() => {
     const resolvedArea = getResolvedArea(area, areaCodes);
-    if (resolvedArea !== area) {
+    if (false) {
       setArea(resolvedArea);
     }
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Searching for A1 in S21
Received:
  Searching for in S21

[Killed] ObjectLiteral
main/components/GEAreas/GEAreaSearchForm.jsx:57:22
     event.preventDefault();
     localStorage.setItem(quarterKey, quarter);
     localStorage.setItem(areaKey, area);
-    fetchJSON(event, { quarter, area });
+    fetchJSON(event, {});
   };
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,
