[Killed] BlockStatement
main/components/GEAreas/geAreaSearchFormUtils.js:1:48
-export const deduplicateAreaCodes = (areas) => {
-  const normalizedAreaCodes = (areas ?? [])
-    .map((r) => r?.requirementCode)
-    .filter((code) => typeof code === "string" && code.trim() !== "")
-    .map((code) => code.trim());
-
-  return Array.from(new Set(normalizedAreaCodes));
-};
+export const deduplicateAreaCodes = (areas) => {};
 
 export const getResolvedArea = (currentArea, areaCodes) => {
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
main/components/GEAreas/geAreaSearchFormUtils.js:2:32
 export const deduplicateAreaCodes = (areas) => {
-  const normalizedAreaCodes = (areas ?? [])
+  const normalizedAreaCodes = (areas && [])
     .map((r) => r?.requirementCode)
     .filter((code) => typeof code === "string" && code.trim() !== "")
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expected '' to be 'A1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] MethodExpression
main/components/GEAreas/geAreaSearchFormUtils.js:2:31
 export const deduplicateAreaCodes = (areas) => {
-  const normalizedAreaCodes = (areas ?? [])
-    .map((r) => r?.requirementCode)
-    .filter((code) => typeof code === "string" && code.trim() !== "")
+  const normalizedAreaCodes = (areas ?? []).map(r => r?.requirementCode)
     .map((code) => code.trim());
 
killedBy: geAreaSearchFormUtils tests deduplicateAreaCodes trims, filters, and de-duplicates codes
statusReason: Cannot read properties of null (reading 'trim')

[Killed] ArrowFunction
main/components/GEAreas/geAreaSearchFormUtils.js:3:10
 export const deduplicateAreaCodes = (areas) => {
   const normalizedAreaCodes = (areas ?? [])
-    .map((r) => r?.requirementCode)
+    .map(() => undefined)
     .filter((code) => typeof code === "string" && code.trim() !== "")
     .map((code) => code.trim());
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expected '' to be 'A1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] OptionalChaining
main/components/GEAreas/geAreaSearchFormUtils.js:3:17
 export const deduplicateAreaCodes = (areas) => {
   const normalizedAreaCodes = (areas ?? [])
-    .map((r) => r?.requirementCode)
+    .map((r) => r.requirementCode)
     .filter((code) => typeof code === "string" && code.trim() !== "")
     .map((code) => code.trim());
killedBy: geAreaSearchFormUtils tests deduplicateAreaCodes trims, filters, and de-duplicates codes
statusReason: Cannot read properties of undefined (reading 'requirementCode')

[Killed] ArrowFunction
main/components/GEAreas/geAreaSearchFormUtils.js:4:13
 export const deduplicateAreaCodes = (areas) => {
   const normalizedAreaCodes = (areas ?? [])
     .map((r) => r?.requirementCode)
-    .filter((code) => typeof code === "string" && code.trim() !== "")
+    .filter(() => undefined)
     .map((code) => code.trim());
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expected '' to be 'A1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] EqualityOperator
main/components/GEAreas/geAreaSearchFormUtils.js:4:23
 export const deduplicateAreaCodes = (areas) => {
   const normalizedAreaCodes = (areas ?? [])
     .map((r) => r?.requirementCode)
-    .filter((code) => typeof code === "string" && code.trim() !== "")
+    .filter((code) => typeof code !== "string" && code.trim() !== "")
     .map((code) => code.trim());
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expected '' to be 'A1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] BlockStatement
main/components/GEAreas/geAreaSearchFormUtils.js:10:60
   return Array.from(new Set(normalizedAreaCodes));
 };
 
-export const getResolvedArea = (currentArea, areaCodes) => {
-  if (currentArea) {
-    return currentArea;
-  }
-
-  const firstAreaCode = areaCodes?.[0];
-  return firstAreaCode || "";
-};
+export const getResolvedArea = (currentArea, areaCodes) => {};
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Unable to find an element with the text: Searching for B in M21. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/GEAreas/geAreaSearchFormUtils.js:11:7
 };
 
 export const getResolvedArea = (currentArea, areaCodes) => {
-  if (currentArea) {
+  if (false) {
     return currentArea;
   }
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Unable to find an element with the text: Searching for B in M21. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/GEAreas/geAreaSearchFormUtils.js:11:7
 };
 
 export const getResolvedArea = (currentArea, areaCodes) => {
-  if (currentArea) {
+  if (true) {
     return currentArea;
   }
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Searching for A1 in S21
Received:
  Searching for in S21

[Killed] OptionalChaining
main/components/GEAreas/geAreaSearchFormUtils.js:15:25
     return currentArea;
   }
 
-  const firstAreaCode = areaCodes?.[0];
+  const firstAreaCode = areaCodes[0];
   return firstAreaCode || "";
 };
killedBy: geAreaSearchFormUtils tests getResolvedArea returns empty string when no area is resolvable
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
main/components/GEAreas/geAreaSearchFormUtils.js:16:10
   }
 
   const firstAreaCode = areaCodes?.[0];
-  return firstAreaCode || "";
+  return false;
 };
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Searching for A1 in S21
Received:
  Searching for in S21

[Killed] LogicalOperator
main/components/GEAreas/geAreaSearchFormUtils.js:16:10
   }
 
   const firstAreaCode = areaCodes?.[0];
-  return firstAreaCode || "";
+  return firstAreaCode && "";
 };
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Searching for A1 in S21
Received:
  Searching for in S21
